package Leetcode;

public class 推箱子 {
    /**
     * 推箱子是一种风靡全球的益智小游戏，玩家需要将箱子推到仓库的目标位置。
     * 游戏地图用大小为n*m的网格grid表示，其中每个元素可以是墙，地板或者是箱子
     * 现在你将作为玩家参与游戏，按照规则将箱子‘B’移动到目标位置‘T’
     * 玩家将字符‘S’表示，只要他在地板上，就可以在网格中向上，下，左，右四个方向移动
     * 地板用字符‘.’，意味着可以自由行走
     * 墙用字符‘#’，意味者障碍物，不能行走。
     * 箱子仅有一个，用字符‘B’表示。相应地，网格上有一个目标位置‘T’
     * 玩家需要站在箱子旁边，然后沿着箱子的方向，进行移动，此时箱子会被移动到相邻的地板单元格。记作一次推动。
     * 玩家无法越过箱子。
     * 返回将箱子推到目标位置的最小推动次数，如果无法做到，返回-1.
     */
    public static void main(String[] args) {

    }
}
